---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarNotEnoughRefs
source: html/83791cdd-8ed4-b028-ae53-d212d6ad3731.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarNotEnoughRefs Property

Structural Connection Handler cannot connect too far elements

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionTooFarNotEnoughRefs { get; }
```